
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиЗапчастей Приход
	Движения.ОстаткиЗапчастей.Записывать = Истина;
	Для Каждого ТекСтрокаЗапчасти Из Запчасти Цикл
		Движение = Движения.ОстаткиЗапчастей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Запчасть = ТекСтрокаЗапчасти.Запчасть;
		Движение.Количество = ТекСтрокаЗапчасти.Количество;
		Движение.Сумма = ТекСтрокаЗапчасти.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
