
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ВИН = ВРег(СокрЛП(VIN));
	
	// Проверка длины
	Если СтрДлина(ВИН) <> 17 Тогда
		СообщитьОбОшибке("VIN должен содержать 17 символов", Отказ);
	КонецЕсли;
	
	// Проверка запрещённых символов
	ЗапрещенныеСимволы = СтрРазделить("I,O,Q", ",");
	Для Каждого ЗапрещенныйСимвол Из ЗапрещенныеСимволы Цикл
		Если СтрНайти(ВИН, ЗапрещенныйСимвол) > 0 Тогда
			СообщитьОбОшибке("VIN не должен содержать символ " + ЗапрещенныйСимвол, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка уникальности
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Автомобили.Владелец КАК Владелец
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|ГДЕ
	|	Автомобили.VIN = &VIN
	|	И Автомобили.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("VIN", ВИН);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда       
		ТекстОшибки = СтрШаблон("Автомобиль с VIN %1 уже записан у клиента «%2»", ВИН, Выборка.Владелец);
		СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;
	
	
КонецПроцедуры		

Процедура СообщитьОбОшибке(ТекстОшибки, Отказ)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстОшибки;
	Сообщение.Поле = "VIN";
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры