#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	// Если автомобиль заполнен и принадлежит другому клиенту — очистить
	Если НЕ ЗначениеЗаполнено(Объект.Автомобиль) Тогда 
		Возврат;
		
	КонецЕсли;

	Если ВладелецАвтомобиля(Объект.Автомобиль) <> Объект.Клиент Тогда
		Объект.Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
		
	КонецЕсли;	
			
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Цена = ЦенаНормочасаНаДату(Объект.Дата);
	
	Для Каждого СтрокаРаботы Из Объект.Работы Цикл
		СтрокаРаботы.ЦенаНормочаса = Цена;
		РассчитатьСуммуРаботы(СтрокаРаботы);
	КонецЦикла;
	
КонецПроцедуры  


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыРаботы 

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	Строка = Элементы.Работы.ТекущиеДанные;
	Данные = ДанныеРаботы(Строка.Работа, Объект.Дата);
	
	Строка.Нормочасы = Данные.Нормочасы;
	Строка.ЦенаНормочаса = Данные.Цена;
	
	РассчитатьСуммуРаботы(Строка);

КонецПроцедуры 

&НаКлиенте
Процедура РаботыНормочасыПриИзменении(Элемент)
	
	Строка = Элементы.Работы.ТекущиеДанные;
	РассчитатьСуммуРаботы(Строка);
	
КонецПроцедуры

	
#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыЗапчасти

&НаКлиенте
Процедура ЗапчастиКоличествоПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Запчасти.ТекущиеДанные;
	РассчитатьСуммуЗапчасти(СтрокаТаблицы);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗапчастиЦенаПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Запчасти.ТекущиеДанные;
	РассчитатьСуммуЗапчасти(СтрокаТаблицы);
	
КонецПроцедуры


	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуРаботы(Строка)
	Строка.Сумма = Строка.Нормочасы * Строка.ЦенаНормочаса;
	

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуЗапчасти(СтрокаТаблицы)
	СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Цена;


КонецПроцедуры

&НаСервереБезКонтекста
Функция ВладелецАвтомобиля(Автомобиль)
	Возврат Автомобиль.Владелец;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеРаботы(Работа, Дата)
	Результат = Новый Структура("Нормочасы, Цена");
	
	Результат.Нормочасы = Работа.НормаВремени;
	
	Результат.Цена = ЦенаНормочасаНаДату(Дата);
	
	Возврат Результат;
		

КонецФункции

&НаСервереБезКонтекста
Функция ЦенаНормочасаНаДату(Дата)
	Цены = РегистрыСведений.СтоимостьНормочаса.ПолучитьПоследнее(Дата);
	Возврат Цены.Стоимость;

КонецФункции

	
#КонецОбласти


 




